swak4foam/Examples/groovyBC/average-t-junction/constant/turbulenceProperties.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

<!--(if foamVersion>=(3,) and foamFork in ["openfoam","openfoamplus"])-->
simulationType  RAS;
<!--(else)-->
simulationType  RASModel;
<!--(end)-->

RAS {
        #include "RASProperties"
 }

// ************************************************************************* //
